removed un-necessary code and updated design.md
